swak4foam/Examples/groovyBC/pulsedPitzDaily/0.org/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet           
    {
        type            groovyBC;
        // Just to test whether it works. Has nothing to do with reality
        valueExpression "symm(U*vector(randNormal(),randNormal(),randNormal()))";
        value           uniform (0 0 0 0 0 0);
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0 0 0 0);
        value           uniform (0 0 0 0 0 0);
    }

    upperWall       
    {
        type            zeroGradient;
    }

    lowerWall       
    {
        type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
