swak4foam/Examples/groovyBC/pulsedPitzDaily/0.org/distance
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      distance;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack    
    {
        type            empty;
    }

    inlet
    {
        type fixedValue;
        value uniform 0;
    }

    outlet          
    {
        type fixedGradient;
        gradient uniform 1;
    }

    ".*"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
