swak4foam/Examples/groovyBC/pulsedPitzDaily/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    upperWall       
    {
        type            fixedValue;
        value           uniform 0;
    }

    lowerWall       
    {
        type            fixedValue;
        value           uniform 0;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
